Ninagawa123/Meridian_TWIN/Meridian_TWIN_for_ESP32/src/main.cpp
// Meridian_TWIN_for_ESP32_20221028 By Izumi Ninagawa & Meridian Project
// MIT Licenced.
//
// Meridan TWIN ESP32用スケッチ　20221028版
// スレッド制を見直し, 連続する工程をひとまとまりに.
// UDPの受信待受とSPI待受でループするようにした.
// UDP受信についてタイムアウトを導入.
// 動作が大幅に安定し通信エラーはほぼゼロ.
// よって現状では通信に影響のないKRC-5FHをTeensy側に接続するのがよい.
// PCからのリモコン受信をTeensyにも反映できるように調整

//【課題】
// PS4リモコンを接続するとTeensyの受信スキップが5~10%発生する. 2022.07.30
// Wiiリモコンを接続すると受信スキップは1%以下だが、最初のコネクション確立がしにくい. 2022.07.30
// よって現状では通信に影響のないKRC-5FHをTeensy側に接続するのがよい. 2022.07.30
// BNO055をオンにすると若干delayが発生する不具合が未解決 2022.10.28

//【更新情報】
// 221025 シーケンス番号をunsigned shortとし, 0~59,999とした.
// 221025 Meridimの共用体にunsigned shortのusvalを追加した.
// 221025 ※よって、Teensy,ESP,Meridian Consoleをすべて最新版にアップデートする必要あり

#define VERSION "Meridian_TWIN_for_ESP32_20221028." // バージョン表示

//================================================================================================================
//---- E S P 3 2 の 配 線  ----------------------------------------------------------------------------------------
//================================================================================================================
/*
  ESP32devkitC  -  Teensy4.0 or PIN
  [3.3v]        -> x
  [EN]          -> x
  [SENSOR_VP]   -> x
  [SENSOR_VN]   -> x
  [34]          -> x
  [35]          -> x
  [32]          -> x
  [33]          -> x
  [25]          -> x
  [26]          -> x
  [27]          -> x
  [14]          -> SPI/SD_SCK (Teensy[13]) & SD_CLK (SD[5])
  [12]          -> MISO (Teensy[12])
  [GND1]        -> x
  [13]          -> MOSI (Teensy[11])
  [D2]          -> x
  [D3]          -> x
  [CMD]         -> x
  [5V]          -> 5V

  [GND3]        -> GND
  [23]          -> x
  [22]          -> x
  [TXD0]        -> x
  [RXD0]        -> x
  [21]          -> x
  [GND2]        -> x
  [19]          -> x
  [18]          -> x
  [05]          -> x
  [17]          -> x
  [16]          -> x
  [04]          -> x
  [00]          -> x
  [02]          -> x
  [15]          -> SPI_CS (Teensy[10])
  [D1]          -> x
  [D0]          -> x
  [CLK]         -> x
*/

//================================================================================================================
//---- 初 期 設 定  -----------------------------------------------------------------------------------------------
//================================================================================================================

/* 頻繁に変更するであろう変数 #DEFINE */
#define FRAME_DURATION 10               // 1フレームあたりの単位時間（単位ms）
#define UDP_TIMEOUT 4                   // UDPの待受タイムアウト（単位ms）
#define AP_SSID "xxxxxx"             // アクセスポイントのAP_SSID
#define AP_PASS "xxxxxx"              // アクセスポイントのパスワード
#define SEND_IP "192.168.1.11"          // 送り先のPCのIPアドレス（PCのIPアドレスを調べておく）
#define BT_MAC_ADDR "9c:9c:1f:cf:fb:be" // ESP32自身のBluetoothMACアドレス（本プログラムを実行しシリアルモニタで確認）// IPを固定する場合は下記の4項目を設定し, (ES-4-1) WiFi.configを有効にする 固定しない場合はコメントアウト必須
// IPAddress ip(192,168,xx,xx);//ESP32のIPアドレスを固定する場合のアドレス
// IPAddress subnet(255,255,255,0);//ESP32のIPアドレス固定する場合のサブネット
// IPAddress gateway(192,168,xx,xx);//ルーターのゲートウェイを入れる
// IPAddress DNS(8,8,8,8);//DNSサーバーの設定（使用せず）

/* 各種設定 #DEFINE */
#define JOYPAD_MOUNT 0          // ジョイパッドの搭載 (※KRC-5FHはTeensy側に接続)
                                // 0:なし, 1:SBDBT(未), 2:KRC-5FH, 3:PS3(未), 4:PS4 ,5:Wii_yoko, 6:Wii+Nun(未), 7:WiiPRO(未), 8:Xbox(未)
#define JOYPAD_POLLING 10       // ジョイパッドの問い合わせフレーム間隔(PSは10)
#define FLOW_MONITOR 1          // シリアルモニタでフローを表示するかの設定（0:OFF, 1:ON）
#define MSG_SIZE 90             // Meridim配列の長さ設定（デフォルトは90）
bool UDP_SEND = true;           // PCへのデータ送信を行うか
bool UDP_RESEIVE = true;        // PCからのデータ受信を行うか
#define SERIAL_PC 200000        // ESP-PC間のシリアル速度（モニタリング表示用）
#define SEND_PORT 22222         // 送り先のポート番号
#define RESV_PORT 22224         // このESP32のポート番号
#define REMOVE_BONDED_DEVICES 0 // 0でバインドデバイス情報表示, 1でバインドデバイス情報クリア(BTリモコンがペアリング接続できない時に使用)
#define PAIR_MAX_DEVICES 20     // BT接続デバイスの記憶可能数

/* ライブラリ導入 */
#include <Arduino.h>
#include <WiFi.h>    //UDPの設定
#include <WiFiUdp.h> //UDPの設定
WiFiUDP udp;         // wifi設定
#include <ESP32DMASPISlave.h>
ESP32DMASPI::Slave slave;
#include <PS4Controller.h> //PS4コントローラー
#include <ESP32Wiimote.h>  //Wiiコントローラー
ESP32Wiimote wiimote;
#include <SPI.h> // SPI自体は使用しないがBNO055に必要

/* PS4リモコンのためのペアリング情報設定用ライブラリ */
#include "esp_bt_main.h"
#include "esp_bt_device.h"
#include "esp_gap_bt_api.h"
#include "esp_err.h"
uint8_t pairedDeviceBtAddr[PAIR_MAX_DEVICES][6];
char bda_str[18];

/* Meridim配列設定 */
const int MSG_BUFF = MSG_SIZE * 2;     // Meridim配列のバイト長
const int MSG_ERR = MSG_SIZE - 2;      // エラーフラグの格納場所（配列の末尾から2つめ）
const int MSG_ERR_u = MSG_ERR * 2 + 1; // エラーフラグの格納場所（上位8ビット）
const int MSG_ERR_l = MSG_ERR * 2;     // エラーフラグの格納場所（下位8ビット）

/* システム用変数 */
uint8_t *s_spi_meridim_dma; // DMA用
uint8_t *r_spi_meridim_dma; // DMA用
TaskHandle_t thp[4];        //マルチスレッドのタスクハンドル格納用

/* フラグ関連変数 */
bool spi_ready_flag = true;             // SPI送信の順番制御用
bool udp_rsvd_flag = true;              // UDPスレッドでの受信完了フラグ
bool udp_busy_flag = false;             // UDPスレッドでの受信中フラグ（送信抑制）
unsigned short frame_sync_r_expect = 0; // シーケンス番号確認用.フレーム毎に前回受信値に+1して受信値と比較（0~59999)
int udp_resv_timeout = 0;               // UPD受信のタイムアウト

/* Meridim配列用の共用体の設定 */
typedef union
{
  short sval[MSG_SIZE + 2];           // short型で90個の配列データを持つ
  unsigned short usval[MSG_SIZE + 2]; // 上記のunsigned short型
  uint8_t bval[MSG_BUFF + 4];         // 1バイト単位で180個の配列データを持つ
} UnionData;
UnionData s_spi_meridim; // SPI受信用共用体
UnionData r_spi_meridim; // SPI受信用共用体
UnionData s_udp_meridim; // UDP送信用共用体
UnionData r_udp_meridim; // UDP受信用共用体
// UnionData pad_bt_meridim; // リモコンのBT受信用共用体のインスタンスを宣言

/* リモコン用変数 */
int joypad_search = 3;
unsigned short pad_btn = 0;
short pad_stick_R = 0;
short pad_stick_R_x = 0;
short pad_stick_R_y = 0;
short pad_stick_L = 0;
short pad_stick_L_x = 0;
short pad_stick_L_y = 0;
short pad_stick_V = 0;
short pad_R2_val = 0;
short pad_L2_val = 0;
// long pad_btn_disp = 65536; //ディスプレイ表示用（バイナリ表示の上位ビット）

//================================================================================================================
//---- 関 数 各 種  -----------------------------------------------------------------------------------------------
//================================================================================================================

// +----------------------------------------------------------------------
// | 関数名　　:  checksum_val(short arr[], int len)
// +----------------------------------------------------------------------
// | 機能     :  配列のチェックサムを算出
// | 　　     :  チェックサムは配列の末尾を除く合計数をビット反転しShort型にしたもの
// | 引数１　　:  Meridim配列(Short型の配列)
// | 引数２　　:  配列の長さ
// | 戻り値　　:  short型. チェックサム値
// +----------------------------------------------------------------------
short checksum_val(short arr[], int len)
{
  int cksm = 0;
  for (int i = 0; i < len - 1; i++)
  {
    cksm += int(arr[i]);
  }
  return short(~cksm);
}

// +-------------------------------------------------------------------
// | 関数名　　:  checksum_rslt(short arr[], int len)
// +-------------------------------------------------------------------
// | 機能     :  チェックサムの合否判定
// | 　　     :  配列の末尾を除く合計数をビット反転しShort型にしたものと, 末尾の値を比較
// | 引数１　　:  Meridim配列(Short型の配列)
// | 引数２　　:  配列の長さ
// | 戻り値　　:  bool型. チェックサム値がOKならtrue, NGならfalse
// +------------------------------------------------------------------
bool checksum_rslt(short arr[], int len)
{
  int cksm = 0;
  for (int i = 0; i < len - 1; i++)
  {
    cksm += int(arr[i]);
  }
  if (short(~cksm) == arr[len - 1])
  {
    return true;
  }
  return false;
}

// +----------------------------------------------------------------------
// | 関数名　　:  initBluetooth()
// +----------------------------------------------------------------------
// | 機能     :  Bluetoothペアリングを設定する
// | 引数　　　:  なし
// +----------------------------------------------------------------------
bool initBluetooth()
{
  if (!btStart())
  {
    Serial.println("Failed to initialize controller");
    return false;
  }

