Ninagawa123/Meridian_TWIN/Meridian_TWIN_for_ESP32/src/main.cpp
  if (esp_bluedroid_init() != ESP_OK)
  {
    Serial.println("Failed to initialize bluedroid");
    return false;
  }

  if (esp_bluedroid_enable() != ESP_OK)
  {
    Serial.println("Failed to enable bluedroid");
    return false;
  }
  return true;
}

// +----------------------------------------------------------------------
// | 関数名　　:  *bda2str(const uint8_t* bda, char *str, size_t size)
// +----------------------------------------------------------------------
// | 機能     :  Bluetoothペアリングアドレスを取得する
// | 引数　　　:  なし
// +----------------------------------------------------------------------
char *bda2str(const uint8_t *bda, char *str, size_t size)
{
  if (bda == NULL || str == NULL || size < 18)
  {
    return NULL;
  }
  sprintf(str, "%02x:%02x:%02x:%02x:%02x:%02x",
          bda[0], bda[1], bda[2], bda[3], bda[4], bda[5]);
  return str;
}

// +----------------------------------------------------------------------
// | 関数名　　:  PS4pad_receive()
// +----------------------------------------------------------------------
// | 機能     :  PS4リモコンの入力値を受信し, 以下に値を格納する
// | 　　        pad_btn, pad_L2_val, pad_R2_val, pad_stick_L , pad_stick_R, pad_stick_V
// | 引数　　　:  なし
// +----------------------------------------------------------------------
void PS4pad_receive()
{
  // Below has all accessible outputs from the controller
  if (PS4.isConnected())
  {
    pad_btn = 0;

    if (PS4.Right())
      pad_btn |= (0b00000000 * 256) + 0b00100000;
    if (PS4.Down())
      pad_btn |= (0b00000000 * 256) + 0b01000000;
    if (PS4.Up())
      pad_btn |= (0b00000000 * 256) + 0b00010000;
    if (PS4.Left())
      pad_btn |= (0b00000000 * 256) + 0b10000000;

    if (PS4.Square())
      pad_btn |= (0b10000000 * 256) + 0b00000000;
    if (PS4.Cross())
      pad_btn |= (0b01000000 * 256) + 0b00000000;
    if (PS4.Circle())
      pad_btn |= (0b00100000 * 256) + 0b00000000;
    if (PS4.Triangle())
      pad_btn |= (0b00010000 * 256) + 0b00000000;

    if (PS4.UpRight())
      pad_btn |= (0b00000000 * 256) + 0b00110000;
    if (PS4.DownRight())
      pad_btn |= (0b00000000 * 256) + 0b01100000;
    if (PS4.UpLeft())
      pad_btn |= (0b00000000 * 256) + 0b10010000;
    if (PS4.DownLeft())
      pad_btn |= (0b00000000 * 256) + 0b11000000;

    if (PS4.L1())
      pad_btn |= (0b00000100 * 256) + 0b00000000;
    if (PS4.R1())
      pad_btn |= (0b00001000 * 256) + 0b00000000;

    if (PS4.Share())
      pad_btn |= (0b00000000 * 256) + 0b00000001;
    if (PS4.Options())
      pad_btn |= (0b00000000 * 256) + 0b00001000;
    if (PS4.L3())
      pad_btn |= (0b00000000 * 256) + 0b00000100;
    if (PS4.R3())
      pad_btn |= (0b00000000 * 256) + 0b00000010;

    if (PS4.PSButton())
      pad_btn |= (0b00000000 * 256) + 0b01010000; // same as up & down
    if (PS4.Touchpad())
      pad_btn |= (0b00000000 * 256) + 0b00101000; // same as left & right

    if (PS4.L2())
    {
      pad_btn |= (0b00000001 * 256) + 0b00000000;
      pad_L2_val = constrain(PS4.L2Value(), 0, 255);
    }
    if (PS4.R2())
    {
      pad_btn |= 512; //(0x00000010 * 256) + 0b00000000;
      pad_R2_val = constrain(PS4.R2Value(), 0, 255);
    }

    if (PS4.LStickX())
    {
      pad_stick_L_x = constrain(PS4.LStickX(), -127, 127);
    }
    if (PS4.LStickY())
    {
      pad_stick_L_y = constrain(PS4.LStickY(), -127, 127);
    }
    if (PS4.RStickX())
    {
      pad_stick_R_x = constrain(PS4.RStickX(), -127, 127);
    }
    if (PS4.RStickY())
    {
      pad_stick_R_y = constrain(PS4.RStickY(), -127, 127);
    }

    pad_stick_L = pad_stick_L_x * 256 + pad_stick_L_y;
    pad_stick_R = pad_stick_R_x * 256 + pad_stick_R_y;
    pad_stick_V = pad_L2_val * 256 + pad_R2_val;
  }
}

// +----------------------------------------------------------------------
// | 関数名　　:  Wiipad_receive_h()
// +----------------------------------------------------------------------
// | 機能     :  Wiiコントローラ(横持ち・横持ち+ヌンチャク)の入力値を受信し, 以下に値を格納する
// | 　　        pad_btn, pad_stick_L
// | 引数　　　:  なし
// +----------------------------------------------------------------------
void Wiipad_receive_h()
{
  wiimote.task();
  if (wiimote.available() > 0)
  {
    uint16_t button = wiimote.getButtonState();
    pad_btn = 0;

    if (button & 0x0400)
      pad_btn |= (0b00000000 * 256) + 0b00100000; // right
    if (button & 0x0100)
      pad_btn |= (0b00000000 * 256) + 0b01000000; // down
    if (button & 0x0200)
      pad_btn |= (0b00000000 * 256) + 0b00010000; // up
    if (button & 0x0800)
      pad_btn |= (0b00000000 * 256) + 0b10000000; // left

    if (button & 0x0008)
      pad_btn |= (0b10000000 * 256) + 0b00000000; // A
    if (button & 0x0002)
      pad_btn |= (0b01000000 * 256) + 0b00000000; // 1
    if (button & 0x0001)
      pad_btn |= (0b00100000 * 256) + 0b00000000; // 2
    if (button & 0x0004)
      pad_btn |= (0b00010000 * 256) + 0b00000000; // B

    if (button & 0x0010)
      pad_btn |= (0b00000000 * 256) + 0b00000001; //+
    if (button & 0x1000)
      pad_btn |= (0b00000000 * 256) + 0b00001000; //-

    if (button & 0x0080)
      pad_btn |= (0b00000000 * 256) + 0b01010000; // same as up & down//home

    if (JOYPAD_MOUNT == 6)
    {
      NunchukState nunchuk = wiimote.getNunchukState();
      int calib_l1x = 5;  // LスティックX軸のセンターのキャリブレーション値
      int calib_l1y = -6; // LスティックY軸のセンターのキャリブレーション値
      pad_stick_L = ((nunchuk.xStick + calib_l1x - 127) * 256 + (nunchuk.yStick - 127 + calib_l1y));
      // if (nunchuk.cBtn == 1)
      //    pad_btn |= (0b00000100 * 256) + 0b00000000;
      //  if (nunchuk.zBtn == 1)
      //    pad_btn |= (0x00000001 * 256) + 0b00000000;
    }
    delay(1); //ここの数値でCPU負荷を軽減できるかも?
  }
}

// +----------------------------------------------------------------------
// | 関数名　　:  sendUDP()
// +----------------------------------------------------------------------
// | 機能     :  共用体s_udp_meridimをUDP通信で送信する
// | 引数　　　:  なし
// +----------------------------------------------------------------------
void sendUDP()
{
  udp.beginPacket(SEND_IP, SEND_PORT); // UDPパケットの開始
  udp.write(s_udp_meridim.bval, MSG_BUFF);
  udp.endPacket(); // UDPパケットの終了
}

// +----------------------------------------------------------------------
// | 関数名　　:  receiveUDP()
// +----------------------------------------------------------------------
// | 機能     :  UDP通信の受信パケットを確認する.
// | 　　        受信完了を検出したら共用体 r_udp_meridim に値を格納し,
// | 　　        udp_rsvd_flag のフラグをtrueにする
// | 引数　　　:  なし
// +----------------------------------------------------------------------
void receiveUDP()
{
  if (udp.parsePacket() >= MSG_BUFF) // データの受信バッファ確認
  {
    udp.read(r_udp_meridim.bval, MSG_BUFF); // データの受信
  }
}

// +----------------------------------------------------------------------
// | 関数名　　:  flow_monitor(String str)
// +----------------------------------------------------------------------
// | 機能     :  FLOW_MONITORがtrueの時, strの文字列を表示する. デバグ用.
// | 引数　　　:  String str
// +----------------------------------------------------------------------
void flow_monitor(String str)
{
  if (FLOW_MONITOR)
  {
    Serial.print(str);
  }
}

//================================================================================================================
//---- Bluetooth 用 ス レ ッ ド -----------------------------------------------------------------------------------
//================================================================================================================
void Core0_BT_r(void *args)
{ //サブCPU(Core0)で実行するプログラム
  while (true)
  {                        //ここで無限ループを作っておく
    while (!udp_busy_flag) // UDP使用中を避ける
    {
      // PS4コントローラの受信
      if (JOYPAD_MOUNT == 4)
      {
        PS4pad_receive();
      }
      // Wiiコントローラの受信
      if ((JOYPAD_MOUNT == 5) or (JOYPAD_MOUNT == 6))
      {
        Wiipad_receive_h();
      }
      delay(JOYPAD_POLLING - 1); // JOYPAD_POLLING ms秒待つ
    }
    delay(1); // JOYPAD_POLLING ms秒待つ
  }
}

//================================================================================================================
//---- セ ッ ト ア ッ プ -------------------------------------------------------------------------------------------
//================================================================================================================
void setup()
{
  //-------------------------------------------------------------------------
  //---- 起 動 時 設 定  -----------------------------------------------------
  //-------------------------------------------------------------------------
  /* WiFiの初期化と開始 */
  WiFi.disconnect(true, true); // WiFi接続をリセット
  // WiFi.config(ip, gateway, subnet, DNS);//※IPを固定にする場合はコメントアウトをはずして有効にする(ES-1-1)も変更すること
  WiFi.begin(AP_SSID, AP_PASS); // WiFiに接続
  while (WiFi.status() != WL_CONNECTED)
  {           // https://www.arduino.cc/en/Reference/WiFiStatus 返り値一覧
    delay(1); //接続が完了するまでループで待つ
  }

  /* シリアルモニタ表示 */
  Serial.begin(SERIAL_PC);
  delay(120); //シリアルの開始を待ち安定化させるためのディレイ（ほどよい）
  Serial.println();
  Serial.print("Hello, This is ");                            // バージョン表示
  Serial.println(VERSION);                                    // バージョン表示
  Serial.println("WiFi connected to  => " + String(AP_SSID)); // WiFi接続完了通知
  Serial.print("PC's IP address is  => ");
  Serial.println(SEND_IP);                    // 送信先PCのIPアドレスの表示
  Serial.print("ESP32's IP address is  => "); // ESP32自身のIPアドレスの表示
  Serial.println(WiFi.localIP());

  /* UDP通信の開始 */
  udp.begin(RESV_PORT);
  delay(100);

  /* Bluetoothの初期化 */
  initBluetooth();
  Serial.print("ESP32's Bluetooth Mac Address is => "); // ESP32自身のBluetoothMacアドレスを表示
  Serial.println(bda2str(esp_bt_dev_get_address(), bda_str, 18));
  delay(100);

