Ninagawa123/Meridian_TWIN/Meridian_TWIN_for_ESP32/src/main.cpp
  /* Bluetoothのペアリング情報 */
  int bt_count = esp_bt_gap_get_bond_device_num();
  if (!bt_count)
  {
    Serial.println("No bonded BT device found.");
  }
  else
  {
    Serial.print("Bonded BT device count: ");
    Serial.println(bt_count);
    if (PAIR_MAX_DEVICES < bt_count)
    {
      bt_count = PAIR_MAX_DEVICES;
      Serial.print("Reset bonded device count: ");
      Serial.println(bt_count);
    }
    esp_err_t tError = esp_bt_gap_get_bond_device_list(&bt_count, pairedDeviceBtAddr);
    if (ESP_OK == tError)
    {
      for (int i = 0; i < bt_count; i++)
      {
        Serial.print("Found bonded BT device # ");
        Serial.print(i);
        Serial.print(" -> ");
        Serial.println(bda2str(pairedDeviceBtAddr[i], bda_str, 18));
        if (REMOVE_BONDED_DEVICES)
        {
          esp_err_t tError = esp_bt_gap_remove_bond_device(pairedDeviceBtAddr[i]);
          if (ESP_OK == tError)
          {
            Serial.print("Removed bonded BT device # ");
          }
          else
          {
            Serial.print("Failed to remove bonded BT device # ");
          }
          Serial.println(i);
        }
      }
    }
  }

  /* PS4コントローラの接続開始 */
  if (JOYPAD_MOUNT == 4)
  {
    PS4.begin(BT_MAC_ADDR); // ESP32のMACが入ります.PS4にも設定します.
    Serial.println("PS4 controller connecting...");
  }

  /* Wiiコントローラの接続開始 */
  if ((JOYPAD_MOUNT == 5) or (JOYPAD_MOUNT == 6))
  {
    wiimote.init();
    // wiimote.addFilter(ACTION_IGNORE, FILTER_NUNCHUK_ACCEL);
    Serial.println("Wiimote connecting...");
    joypad_search = 3;
  }

  /* SPI送受信用DMAの設定 */
  s_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  r_spi_meridim_dma = slave.allocDMABuffer(MSG_BUFF + 4); // DMAバッファ設定
  // DMAは高速な上, 一度に送受信できるデータ量を増やせる
  // バッファサイズは4で割り切れる必要があり, また末尾に4バイト分0が入る不具合があるので+4で対策

  /* SPI送受信バッファをリセット */
  memset(s_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策
  memset(r_spi_meridim_dma, 0, MSG_BUFF + 4); // ※+4は不具合対策

  /* SPI通信の初回送信データをセット */
  memset(s_spi_meridim.bval, 0, MSG_BUFF + 4);                                   // ※+4は不具合対策
  s_spi_meridim.sval[MSG_SIZE - 1] = checksum_val(s_spi_meridim.sval, MSG_SIZE); //データ末尾にチェックサムを入れる
  memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);                   // 送信データをDMAバッファに転記

  /* SPI通信の設定 */
  slave.setDataMode(SPI_MODE3);
  slave.setMaxTransferSize(MSG_BUFF + 4);
  slave.setDMAChannel(2); // 専用メモリの割り当て(1か2のみ)
  slave.setQueueSize(1);  // キューサイズ　とりあえず1
  slave.begin();          // 引数を指定しなければデフォルトのSPI（SPI2,HSPIを利用）ピン番号は CS: 15, CLK: 14, MOSI: 13, MISO: 12
  delay(100);             //この行は削除できそう

  /* スレッドの開始 */
  // マルチスレッドの宣言（無線系はすべてCORE0で動く.メインループはCORE1）
  //  xTaskCreatePinnedToCore(Core1_SPI, "Core1_SPI", 4096, NULL, 15, &thp[0], 1);
  //  xTaskCreatePinnedToCore(Core0_UDP, "Core0_UDP", 4096, NULL, 10, &thp[1], 0);
  xTaskCreatePinnedToCore(Core0_BT_r, "Core0_BT_r", 4096, NULL, 5, &thp[2], 0);
}

//================================================================================================================
//---- メ　イ　ン　ル　ー　プ-----------------------------------------------------------------------------------------
//================================================================================================================
void loop()
{

  //------------------------------------------------------------------------
  // [ 1 ]  S P I 送 受 信 の 実 行
  //------------------------------------------------------------------------

  // @[1-1] SPI通信のトランザクションがなければデータをキューに補充
  if (slave.remained() == 0)
  {
    if (spi_ready_flag) // SPI送信データの作成が完了しているか
    {
      flow_monitor("[1]"); // 動作チェック用シリアル表示
      slave.queue(r_spi_meridim_dma, s_spi_meridim_dma, MSG_BUFF + 4);
      // delayMicroseconds(10);
      spi_ready_flag = false;
    }
  }

  // [check!] ここがTeensyをマスターとして実施されるSPI通信の完了を待つ待機ループになる

  // @[1-2] SPI通信で受信したデータについての処理（工程[6]まで一気に行う）
  while (slave.available()) // SPI受信を完了したデータについての作業はこのwhileの中で行う
  {
    memcpy(s_udp_meridim.bval, r_spi_meridim_dma, MSG_BUFF + 4); // DMAのSPI受信データをUDP送信配列に転記
    slave.pop();                                                 // DMAのデータ配列の先頭を削除

    //------------------------------------------------------------------------
    // [ 2 ]  U D P 送 信 デ ー タ 作 成
    //------------------------------------------------------------------------
    flow_monitor("[2]"); // 動作チェック用シリアル表示

    // → ここでチェックサムを行ってもよい.
    // → Teensyからのリモコン値はここでのみ補足可能.
    // → 今回は特になにもなし.

    //------------------------------------------------------------------------
    // [ 3 ]  U D P 送 信 実 行
    //------------------------------------------------------------------------
    flow_monitor("[3]"); // 動作チェック用シリアル表示

    udp_busy_flag = true; // UDP使用中のフラグをアゲる
    // @[3-1] SPI送受信の実行
    sendUDP(); // UDP送信を実行
    // delayMicroseconds(1);

    //------------------------------------------------------------------------
    // [ 4 ]  U D P 受 信 待 受 ル ー プ
    //------------------------------------------------------------------------
    flow_monitor("[4]"); // 動作チェック用シリアル表示

    //[4-1] UDP受信の待受
    udp_rsvd_flag = false;
    udp_resv_timeout = 0;
    while (!udp_rsvd_flag) // データの受信バッファ確認
    {
      short udp_packet = udp.parsePacket();
      if (udp_packet >= MSG_BUFF)
      {
        udp.read(r_udp_meridim.bval, MSG_BUFF); // データの受信
        udp_rsvd_flag = true;
        flow_monitor("!"); // 動作チェック用シリアル表示
      }
      if (udp_resv_timeout > UDP_TIMEOUT) // UDPの受信待ちのタイムアウト
      {
        flow_monitor("*UdpResvTimeOut"); // 動作チェック用シリアル表示
        break;
      }
      udp_resv_timeout++;
      delay(1);
    }
    udp_busy_flag = false; // UDP使用中のフラグをサゲる

    //------------------------------------------------------------------------
    // [ 5 ]  U D P 受 信 品 質 チ ェ ッ ク
    //------------------------------------------------------------------------
    flow_monitor("[5]"); // 動作チェック用シリアル表示

    // @[5-1] UDP受信データ r_udp_meridim のチェックサムを確認.
    if (checksum_rslt(r_udp_meridim.sval, MSG_SIZE))
    {
      // @[5-2a] 受信成功ならUDP受信データをSPI送信データに上書き更新する.
      memcpy(s_spi_meridim.bval, r_udp_meridim.bval, MSG_BUFF + 4);
      s_spi_meridim.bval[MSG_ERR_u] &= 0b10111111; // meridimの[MSG_ERR]番の14ビット目(ESPのUDP受信成否)のフラグをサゲる.
    }
    else
    {
      // @[5-2b] 受信失敗なら今回の受信データを使わず、前回のSPI送信データにエラーフラグだけ上乗せする.
      s_spi_meridim.bval[MSG_ERR_u] |= 0b01000000; // meridimの[MSG_ERR]番の14ビット目(ESPのUDP受信成否)のフラグをアゲる.
    }

    // @[5-3] 連番スキップ検出

    // @[5-3-1] シーケンス番号の予想値を生成
    // frame_sync_r_expect++;           // フレームカウント予想値を加算
    // if (frame_sync_r_expect > 59999) // 予想値が29,999以上ならカウントを-30000に戻す
    //{
    // frame_sync_r_expect = 0;
    //}

    // @[5-3-2] シーケンス番号のチェック
    // if (frame_sync_r_expect == s_spi_meridim.usval[1]) // 受信シーケンス番号の値が予想通りなら,
    //{
    // s_spi_meridim.bval[MSG_ERR_u] &= 0b11111011; // エラーフラグ10番(ESP受信のスキップ検出)をサゲる.
    //}
    // else // 受信シーケンス番号の値が予想と違ったら,
    //{
    // frame_sync_r_expect = s_spi_meridim.usval[1]; // 現在の受信値を予想結果としてキープ
    // s_spi_meridim.bval[MSG_ERR_u] |= 0b00000100;  // エラーフラグ10番(ESP受信のスキップ検出)をアゲる.
    //}

    // [check!] ここで s_spi_meridim にはチェック済みの r_udp_meridim が転記され, ESP32UDP受信エラーフラグも入った状態.

    //------------------------------------------------------------------------
    // [ 6 ]  S P I 送 信 デ ー タ 作 成
    //------------------------------------------------------------------------
    flow_monitor("[6]\n"); // 動作チェック用シリアル表示

    // @[6-1] ユーザー定義の送信データの書き込み
    // Teensyへ送るデータをこのパートで作成, 書き込み.
    // → 今回はとくに何もしない.

    // @[6-2] リモコンデータの書き込み
    s_spi_meridim.sval[15] = r_udp_meridim.sval[15] | pad_btn;
    s_spi_meridim.sval[16] = r_udp_meridim.sval[16] | pad_stick_L;
    s_spi_meridim.sval[17] = r_udp_meridim.sval[17] | pad_stick_R;
    s_spi_meridim.sval[18] = r_udp_meridim.sval[18] | pad_stick_V;

    // @[6-3] フレームスキップ検出用のカウントを転記して格納（PCからのカウントと同じ値をESPに転送）
    // → すでにPCから受け取った値がs_spi_meridim.sval[1]に入っているのでここでは何もしない.

    // @[6-4] チェックサムの追記
    s_spi_meridim.sval[MSG_SIZE - 1] = checksum_val(s_spi_meridim.sval, MSG_SIZE);
    // [check!] ここでSPI送信データ s_spi_meridim はチェックサムが入り完成している状態.

    // @[6-5] 完成したSPI送信データをDMAに転記
    memcpy(s_spi_meridim_dma, s_spi_meridim.bval, MSG_BUFF + 4);
    spi_ready_flag = true; // SPI送信の順番制御用
    // [check!] 次回のSPI送受信に備え、DMAにデータが格納された状態.
  }
}
